Lab4/bodylog.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><Sum xmlns="http://LDI/"><a1><s>hello</s><k>10</k><f>15.55</f></a1><a2><s> world</s><k>15</k><f>5.5</f></a2></Sum></soap:Body></soap:Envelope>